# 1-8newnew

#include <stdio.h>
#include <string.h>
#include <math.h>
#include <locale.h>
#include <stdlib.h>
#include <time.h>

int main(void) { 
	
  int k,m;
  scanf("%d%d", &k,&m);

	if (k < 1) k = 1;


  for (int i = k; i <= m; i++)
{
	printf (" %d\n", i);
}

	printf("%d", m-k+1);
	
  return 0;
}


Усовершенствовать программму, написанную на прошлом шаге: дополнительно на отдельной строке вывести количество напечатанных чисел.

Входные данные:
Два целых числа 
K
,
M
K,M. При этом 
M
M больше 
K
K.

Выходные данные: 
Натуральные числа в порядке возрастания, принадлежащие промежутку 
[
K
,
M
]
[K,M]. Числа нужно разделять одним пробелом.
На новой строке вывести количество выведенных натуральных чисел.

NB! На конце первой строки обязательно должен ставиться пробел.
